In [1]:
#Data Frame

In [2]:
#Creating the data frame

In [8]:
import numpy as np
import pandas as pd

In [53]:
#creating by distnary
data = {
    'Name': ['Jhon','Anna','Peter','Linda'],
    'Age' : [28,34,29,42],
    'City': ['New York','Paris','Berlin','London'],
    'Salary':[65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)

In [62]:
#creating by List
data_list = [
    ['Jhon',28,'New York',65000],
    ['Anna',34,'Paris', 70000],
     ['Peter',29,'Berlin', 62000],
    ['Linda',42 ,'London', 85000]
    ]
df2 = pd.DataFrame(data_list)
columns = ['Name', 'Age', 'City','Salary']
df2 = pd.DataFrame(data_list,columns = columns)
df2

    Name  Age      City  Salary
0   Jhon   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [20]:
#Selecting and Indexing of column

In [63]:
df2

    Name  Age      City  Salary
0   Jhon   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [64]:
df2[['Name','City']]

    Name      City
0   Jhon  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [26]:
#creating new columns

In [65]:
df2['Designation']= ['Doctor','Eng.','Doctor','Eng.']

In [66]:
df2

    Name  Age      City  Salary Designation
0   Jhon   28  New York   65000      Doctor
1   Anna   34     Paris   70000        Eng.
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000        Eng.

In [67]:
#Removing Column

In [68]:
df2.drop('Designation',axis=1,inplace=True)

In [69]:
df2

    Name  Age      City  Salary
0   Jhon   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [70]:
#Selecting Row

In [71]:
df2

    Name  Age      City  Salary
0   Jhon   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [72]:
df2.loc[[0,1]]

   Name  Age      City  Salary
0  Jhon   28  New York   65000
1  Anna   34     Paris   70000

In [73]:
df2.iloc[3]

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

In [74]:
#Selecting Subset of Row and Columns

In [75]:
df.loc[[0,1]][['City','Salary']]

       City  Salary
0  New York   65000
1     Paris   70000

In [76]:
df.loc[[2,3]][['Name','Age']]

    Name  Age
2  Peter   29
3  Linda   42

In [77]:
#Conditional Selection

In [78]:
df2

    Name  Age      City  Salary
0   Jhon   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [79]:
#age above 30

df2[df2["Age"]>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [86]:
#Q2
df2[(df2['Age']>30) & (df2['City'] =='Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000